[{
  "id": "exp_autoval",
  "title": "AutoVal: Used Car Sales Prediction & Dashboard",
  "date": "2025-04 to 2025-06",
  "context": "non-profit (DataKind) project + peer collaboration",
  "description": "Developed AutoVal, an end-to-end data science solution designed to help a nonprofit understand second-hand car pricing dynamics. The project included a Power BI dashboard, a machine learning prediction tool, and a detailed insights report.",
  "actions": "Built the entire data pipeline, cleaned and structured the dataset, engineered features, conducted exploratory data analysis, and trained a Random Forest model for price prediction. Developed a Streamlit web application enabling real-time price estimates. Created a Power BI dashboard to visualize key trends such as fuel type distribution, ownership history, kilometers driven, imperfections, and repainting. Synthesized findings into a comprehensive insights report for nonprofit stakeholders. Worked independently while regularly collaborating with a peer group to exchange ideas and receive feedback.",
  "skills": [
    "Python",
    "Pandas",
    "NumPy",
    "Seaborn",
    "Matplotlib",
    "scikit-learn",
    "Data Cleaning",
    "Feature Engineering",
    "Random Forest",
    "Streamlit",
    "Power BI",
    "Dashboarding",
    "Data Pipelines",
    "Collaboration",
    "Communication"
  ],
  "impact": "Delivered a multi-component system under a tight deadline, providing the nonprofit with actionable insights to support individuals navigating the used-car resale market. The dashboard and ML tool offered accessible, data-driven guidance and improved understanding of pricing patterns across vehicle conditions.",
  "challenges": "Faced inconsistent and unstructured data across multiple features such as imperfections, repainting, and ownership categories. Balancing three deliverables—dashboard, ML model, and written report—under a limited timeline required strict prioritization and workflow management. Designing a model that reflected real-world relationships, such as how imperfections reduce price, required iterative experimentation and validation.",
  "tags": ["machine learning", "dashboarding", "non-profit", "data science", "collaboration", "end-to-end project"]
},

{
  "id": "exp_cinematch",
  "title": "CineMatch: Multi-Model Movie Recommendation System",
  "date": "2025-06",
  "context": "personal project",
  "description": "Developed CineMatch, a movie recommendation system featuring three distinct recommendation engines: a content-based recommender using TF-IDF and cosine similarity, an interactive quiz-based recommender gathering genre, language, and decade preferences, and a hybrid model combining both approaches for more accurate suggestions. The app fetches dynamic movie posters via the OMDb API and uses Streamlit's session state for smooth UI interactions.",
  "actions": "Implemented TF-IDF vectorization, similarity computation, and quiz-based user input handling. Designed a hybrid model that merges content similarity with user preferences. Built a fully functional Streamlit application, integrated dynamic poster fetching through OMDb API, and ensured state management for seamless user experience. Continuously iterated on UI and recommendation logic to improve engagement.",
  "skills": ["Python", "Pandas", "Scikit-learn", "Streamlit", "TF-IDF", "Cosine Similarity", "OMDb API", "UI/UX Design", "Hybrid Modeling"],
  "impact": "Delivered a multi-engine recommendation system that provides personalized, engaging movie suggestions. Improved understanding of recommendation systems, user-centered design, and deploying interactive ML apps.",
  "challenges": "Handled sparse and inconsistent movie metadata, tuned TF-IDF parameters and similarity thresholds for meaningful recommendations, and designed a hybrid system that effectively combines content-based and quiz-based filtering. Managing session state in Streamlit to maintain user interactions across the quiz and recommendations required careful handling.",
  "tags": ["machine learning", "recommendation system", "NLP", "personal project", "user experience", "streamlit"]
}, 
{
  "id": "exp_theraplay",
  "title": "TheraPlay: Platform for Connection and Growth",
  "date": "2024-10",
  "context": "hackathon/full-stack project",
  "description": "Developed TheraPlay, a platform designed to foster anonymous, supportive connections for individuals facing personal challenges such as loneliness, grief, or career uncertainties. Features include secure profile setup, user matching, interactive chat (voice and text), collaborative drawing on a shared canvas, and AI-generated session insights.",
  "actions": "Implemented frontend using HTML, CSS, and JavaScript for a sleek and dynamic user interface. Built backend functionality with Node.js used Socket.io for real-time chat, Fabric.js for collaborative drawing, and Firebase Authentication for secure sign-ins. Integrated ElevenLabs API for speech-to-text and text-to-speech features, and Perplexity AI to provide optional post-session insights. Designed the full workflow for user matching and interactive sessions, ensuring accessibility, privacy, and smooth real-time collaboration.",
  "skills": ["HTML", "CSS", "JavaScript", "Firebase", "Socket.io", "Fabric.js", "Real-Time Collaboration", "AI Integration", "Generative AI", "Full-Stack Development", "User Experience Design"],
  "impact": "Created a safe and engaging platform enabling users to connect anonymously, express themselves creatively, and receive AI-driven insights. Supports emotional well-being and personal growth through innovative, interactive tools.",
  "challenges": "Integrating real-time voice/text chat with collaborative drawing while maintaining state consistency was challenging. Ensuring secure authentication and privacy for users required careful Firebase implementation. Combining multiple APIs (ElevenLabs, Perplexity AI) and maintaining a smooth user experience demanded iterative testing and problem-solving.",
  "tags": ["full-stack", "real-time collaboration", "AI", "generative AI", "user experience", "mental health", "personal project"]
},
{
  "id": "exp_medpill_ai",
  "title": "Medpill AI: Medicine Verification Tool",
  "date": "2025-06",
  "context": "hackathon (Terrahacks) collaborative project",
  "description": "Competed at Terrahacks to solve a healthcare problem: nearly 1 million people die annually from consuming fake or incorrect medicines. Built Medpill AI, a tool that helps users verify if their medicine is genuine using image recognition and similarity search.",
  "actions": "Focused on OCR (Optical Character Recognition) to extract text from medicine images using an OCR API. Designed and implemented a medicine verification strategy: scraped reference images online, ran embeddings-based similarity searches, and combined results to determine authenticity. Collaborated closely with teammates for ideation, testing, and feedback. Integrated technical solutions under tight hackathon deadlines.",
  "skills": ["Python", "OCR", "Embeddings", "Similarity Search", "Web Scraping", "Hackathon Collaboration", "Problem Solving", "Teamwork", "Rapid Prototyping"],
  "impact": "Developed a working prototype that can verify medicines and raise awareness about counterfeit drugs. Gained experience in tackling high-impact healthcare challenges, working in a team, and rapid product development.",
  "challenges": "Extracting accurate text from diverse medicine images was difficult due to variations in fonts, packaging, and lighting. Designing a reliable verification strategy with limited reference data required creative problem-solving. Balancing time constraints and coordinating tasks among team members in a high-pressure hackathon environment was challenging.",
  "tags": ["hackathon", "OCR", "healthcare", "teamwork", "rapid prototyping", "embeddings", "personal project"]
},
{
  "id": "exp_coolcucumbers",
  "title": "CoolCucumbers: Insurance Prediction & Risk Assessment App",
  "date": "2025-11",
  "context": "team project, UW CS Club Project Program",
  "description": "Participated in the CS Club's Project Program at UWaterloo, developing CoolCucumbers, an application that helps homebuyers estimate future insurance prices and assists insurance companies in improving risk quantification to reduce unexpected financial losses. Our team won Best Pitch at the program, recognizing both the potential of our solution and the strength of our presentation.",
  "actions": "Scraped historical environmental and insurance-related data, cleaned and formatted it for modeling, and trained predictive models to estimate future environmental conditions and insurance prices. Collaborated closely with team members to integrate data, develop the app MVP, and prepare a compelling pitch for mentors and judges.",
  "skills": [ "React", "Python", "Data Scraping", "Data Cleaning", "Predictive Modeling", "Machine Learning", "Team Collaboration", "Presentation Skills", "MVP Development"],
  "impact": "Delivered a working MVP in just 3 weeks that demonstrated strong potential for real-world application. Winning Best Pitch at UWaterloo highlighted our ability to build and present impactful solutions under tight timelines.",
  "challenges": "Balancing school commitments while building a solid 3-week project was challenging. Integrating multiple data sources for accurate modeling, designing a predictive pipeline, and coordinating tasks among teammates under time pressure required careful planning and collaboration.",
  "tags": ["team project", "machine learning", "predictive modeling", "data science", "presentation", "rapid prototyping", "award-winning"]
}, 
{
  "id": "exp_physics_pulse",
  "title": "Researcher & Marketing Manager, Physics Pulse",
  "date": "2024-08 to 2025-08",
  "context": "hybrid role at startup/early-stage organization",
  "description": "One of the first members of Physics Pulse, contributing to both research and marketing. Expanded the brand, including updates to the logo, while creating content that made complex physics concepts accessible to a wider audience.",
  "actions": "Researched physics topics in-depth and translated findings into engaging articles. Collaborated with the Content Creator Team to produce visually appealing, informative content. Managed social media presence, curated posts, interacted with followers, and crafted compelling captions. Played a key role in expanding the Physics Pulse brand and visual identity.",
  "skills": ["Research", "Physics Communication", "Social Media Management", "Content Creation", "Collaboration", "Marketing", "Branding", "Audience Engagement"],
  "impact": "Helped grow Physics Pulse's online presence, engage a wider audience with physics content, and strengthen the organization's brand identity.",
  "challenges": "Translating complex physics topics into engaging, accessible content for a general audience. Managing consistent social media engagement while coordinating with a distributed content creation team. Establishing brand identity and updating the logo to align with growth goals.",
  "tags": ["research", "marketing", "content creation", "branding", "social media", "early-stage team", "leadership"]
},
{
  "id": "exp_dawn_graphic_design",
  "title": "Graphic Designer, DAWN",
  "date": "2025-05 to 2025-11",
  "context": "non-profit volunteer role",
  "description": "Contributed as a graphic designer for DAWN, a Toronto-based non-profit combating human trafficking, creating engaging visual content to educate the public, debunk myths, and raise awareness.",
  "actions": "Designed informative and visually appealing content for Instagram and other platforms. Simplified complex information into accessible graphics, ensuring clarity and engagement. Collaborated with team members to align designs with campaigns and organizational messaging.",
  "skills": ["Graphic Design", "Social Media Content", "Visual Communication", "Awareness Campaigns", "Collaboration", "Creativity", "Non-Profit Work"],
  "impact": "Enhanced DAWN's audience engagement and educational outreach, helping to foster a proactive, informed community. Contributed to raising public awareness and amplifying the non-profit's impact in combating human trafficking.",
  "challenges": "Balancing creativity with accuracy and sensitivity due to the serious nature of human trafficking topics. Ensuring content is visually compelling while remaining informative and aligned with DAWN's mission.",
  "tags": ["non-profit", "graphic design", "social impact", "awareness campaigns", "volunteer work", "visual communication"]
},
{
  "id": "exp_focus_youth_finance",
  "title": "Finance Associate, Focus Youth",
  "date": "2024-09 to 2025-06",
  "context": "non-profit / youth-focused event",
  "description": "Worked as a Finance Associate at Focus Youth, organizing and managing marketing and fundraising efforts for a high-impact event targeting around 4000 high school students.",
  "actions": "Coordinated fundraising activities and secured sponsorships to support event execution. Managed a team of 20 members to ensure tasks were completed efficiently. Liaised with sponsors and stakeholders to guarantee smooth execution and maximize event impact. Assisted in marketing initiatives to promote the event and engage the audience.",
  "skills": ["Fundraising", "Sponsorship Management", "Event Coordination", "Teamwork", "Stakeholder Communication", "Marketing", "Leadership"],
  "impact": "Successfully gathered funds and sponsorships, enabling a large-scale event to reach thousands of students. Ensured smooth operations and strong engagement, enhancing the organization’s presence and credibility among youth audiences.",
  "challenges": "Coordinating multiple stakeholders and team members simultaneously while meeting fundraising goals. Balancing marketing, sponsorships, and operational tasks under tight deadlines to ensure a successful event.",
  "tags": ["non-profit", "fundraising", "event management", "teamwork", "stakeholder coordination", "leadership"]
},
{
  "id": "exp_tutor",
  "title": "Part-Time Tutor (Science & Math, Grade 9)",
  "date": "2024-09 to 2025-06",
  "context": "part-time employment / academic support",
  "description": "Tutored grade 9 students in science and math, providing personalized instruction to enhance understanding, academic growth, and problem-solving skills.",
  "actions": "Developed individualized lesson plans tailored to each student's needs. Delivered one-on-one tutoring sessions focused on clarifying concepts, fostering critical thinking, and reinforcing problem-solving strategies. Monitored student progress and adapted teaching methods to ensure continuous improvement.",
  "skills": ["Tutoring", "Lesson Planning", "Academic Mentoring", "Science Education", "Math Education", "Critical Thinking", "Problem Solving", "Student Assessment"],
  "impact": "Helped students improve academically, including a grade 9 student who went from failing to achieving 70% in 5 weeks. Enhanced students' understanding of complex concepts and nurtured independent learning skills.",
  "challenges": "Adapting teaching approaches to fit different learning styles and pace. Ensuring consistent improvement within a limited time frame while maintaining student engagement and confidence.",
  "tags": ["tutoring", "education", "mentoring", "academic support", "personalized learning", "critical thinking"]
},
{
  "id": "exp_crackbig",
  "title": "CrackBig: University Interview Simulator",
  "date": "2025-09",
  "context": "personal full-stack project",
  "description": "Developed CrackBig, an AI-driven web app that simulates university interviews, allowing high school students to practice unlimited interviews, receive feedback, and build confidence.",
  "actions": "Built the frontend with React and the backend with Node.js. Integrated session tracking using React hooks and Node.js to provide personalized feedback and progress insights. Managed deployment on Vercel and Render, resolved key API integration issues, and documented fixes for smoother future development.",
  "skills": ["React", "Node.js", "API Integration", "Session Management", "Full-Stack Development", "Deployment (Vercel, Render)", "AI Integration", "Problem Solving", "Web App Development"],
  "impact": "Delivered a live, AI-driven interview simulation platform helping students practice and improve their university interview skills. The app is currently in progress, continuously evolving with new features and improvements.",
  "challenges": "Setting up video questions for interview simulations was a major challenge. Resolving deployment and API integration issues while ensuring session tracking worked reliably. Designing a scalable system to handle multiple sessions and personalized feedback for each user while maintaining a smooth user experience.",
  "tags": ["full-stack", "AI", "web app", "education technology", "deployment", "React", "Node.js", "personal project"]
},
{
  "id": "exp_wato_project",
  "title": "Wato Design Team Entrance Project",
  "date": "2025-09",
  "context": "personal project / entrance assignment",
  "description": "Completed a hands-on entrance assignment for the Watonomous design team, coding a robot from scratch under a tight deadline. Learned C# and ROS2 in one week to implement hardware-level programming and testing.",
  "actions": "Used AI (ChatGPT) to quickly grasp C# and ROS2 basics, then coded and tested the robot step-by-step. Documented hurdles and solutions, iteratively improving the code. Dedicated 3–4 days in intensive work sessions to complete the project before the deadline, ensuring a functional robot demonstration.",
  "skills": ["C#", "ROS2", "Hardware Programming", "Robot Coding", "Problem Solving", "Self-Learning", "AI-Assisted Learning", "Iterative Development", "Time Management"],
  "impact": "Successfully completed the robot coding assignment under a week, gaining confidence in rapid skill acquisition and hardware-level programming. Demonstrated the ability to learn new technologies quickly and apply them in real-world problems.",
  "challenges": "Learning C# and ROS2 from scratch within a week while implementing hardware-level functionality. Troubleshooting robot code in real-time and ensuring each component worked correctly. Maintaining focus and consistent effort over intensive work sessions.",
  "tags": ["hardware", "robotics", "self-learning", "AI-assisted learning", "rapid skill acquisition", "ROS2", "C#"]
}

]


